moralkerim/STM32Quadrotor/Drone_Controller_3DOF/Core/Src/main.cpp
	if(huart == &huart2) {
	    char_index++;

	    if (ch_rcv_buf[char_index] == 0x01 && ch_rcv_buf[char_index-1] == 0x04) {  //Start char received

	      char *start_adress = ch_rcv_buf;
	      start_adress++;
	      memcpy(&telem, start_adress , sizeof(struct pwm));
	      char_index = 0;
	      inChar_ = inChar;
	      inChar = (char)Serial.read();
	      ToggleLED();

	    }



	    buf[char_index] = inChar;


}

}
*/
#endif

void MagCalib(int16_t MAG_X,int16_t MAG_Y,int16_t MAG_Z) {
	/*
	MAG_X_CALIB = 0.94941*MAG_X - 0.0029894*MAG_Y + 0.0042334*MAG_Z - 163.26;
	MAG_Y_CALIB = 0.94369*MAG_Y - 0.0029894*MAG_X + 0.010705*MAG_Z + 179.65;
	MAG_Z_CALIB = 0.0042334*MAG_X + 0.010705*MAG_Y + 1.1163*MAG_Z - 139.67;
	*/
	MAG_X_CALIB = 0.9655*MAG_X + 0.01389*MAG_Y - 0.01816*MAG_Z + 16.0;
	MAG_Y_CALIB = 0.01389*MAG_X + 0.9476*MAG_Y + 0.006714*MAG_Z + 103.3;
	MAG_Z_CALIB = 0.006714*MAG_Y - 0.01816*MAG_X + 1.094*MAG_Z - 8.554;
}

void checkMode(int mod_ch) {
	  if(mod_ch < 1400) {

		  controller.mod = STABILIZE;
		  controller.z0 = EKF.alt_gnd;
		  controller.x0 = EKF.x;
		  controller.y0 = EKF.y;
		  controller.p_alt.reset();
		  controller.p_velx.reset();
		  controller.p_vely.reset();
	  }

	  else if (mod_ch >=1400 && mod_ch <1700) {
		  //Run (struct state state, struct state state_des, float z_vel, float z0, float z, float ch3),
		 // controller.mod = LOITER;
		  controller.mod = STABILIZE;

		  z0 = controller.p_alt.zi;

	  }

	  else {
		  //controller.mod = LOITER;
		  controller.mod = STABILIZE;
	  }
}

void SwitchMag() {

	char state;

	// determine which state is the switch on
	if		(ch[MAGNET_CH-1] > 750  && ch[MAGNET_CH-1] < 1250) state = 0;
	else if (ch[MAGNET_CH-1] > 1250 && ch[MAGNET_CH-1] < 1750) state = 1;
	else if (ch[MAGNET_CH-1] > 1750 && ch[MAGNET_CH-1] < 2250) state = 2;
	else state = -1;

	// change magnet state based on state of switch
	// state = 0 -> off
	// state = 1 -> attach
	// state = 2 -> separate

	switch(state) {
	case 0:
		HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4|GPIO_PIN_5, GPIO_PIN_RESET);
		break;
	case 1:
		HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_SET);
		HAL_GPIO_WritePin(GPIOA, GPIO_PIN_5, GPIO_PIN_RESET);
		break;
	case 2:
		HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_RESET);
		HAL_GPIO_WritePin(GPIOA, GPIO_PIN_5, GPIO_PIN_SET);
		break;
	default:
		HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4|GPIO_PIN_5, GPIO_PIN_RESET);
		break;
	}
}

void CheckSwarm() {
	if(ch[SWARM_CH-1] > 1500) {
		if(swarm_mode != SWARM) {
			swarm_mode = SWARM;

			controller.swarm = true;

			controller.pid_roll.reset();
			controller.pid_pitch.reset();
			controller.pid_yaw.reset();
		}
	}

	else {
		if(swarm_mode != NORMAL) {
			controller.swarm = false;
			swarm_mode = NORMAL;

			controller.pid_roll.reset();
			controller.pid_pitch.reset();
			controller.pid_yaw.reset();
		}
	}
}

void CheckFailsafe() {

	if(armed) {
		if(ch[2] < 970 && !in_failsafe) {
			in_failsafe = true;
			Fail_Acc = accXc;
		}

		if(failsafe_counter < 1000) {

			if(in_failsafe) { //5 seconds
				if(abs(accXc - Fail_Acc) < ACC_FAIL_LIM) {
					failsafe_counter++;
				}
			}
		}

		else {
			armed = false;
			in_failsafe = false;
			failsafe_counter = 0;
		}
	}


}


void Check_Arm() {
	if(!armed) {
		if((ch[2] < CH3_MIN + 100) && (ch[3] > 1700)) {
				if(!arm_start){
					arm_timer = HAL_GetTick();
					arm_start = true;
				}

				if(HAL_GetTick() - arm_timer > 3000) {
					controller.pid_roll.reset();
					controller.pid_pitch.reset();
					controller.pid_yaw.reset();
					armed = true;
					EKF.armed = true;
					//SetHome2();
					HAL_GPIO_WritePin(GPIOA, GPIO_PIN_15, GPIO_PIN_SET);

					/*
					controller.pid_roll.angle0   = EKF.state.angles[0];
					controller.pid_pitch.angle0  = EKF.state.angles[1];
					*/

				}

		}

		else {
			arm_start = false;
		}
	}

}

void Check_Disarm() {
	if(armed) {
		if((ch[2] < 1100) && (ch[3] < 1100)) {
				if(!disarm_start){
					disarm_timer = HAL_GetTick();
					disarm_start = true;
				}

				if(HAL_GetTick() - disarm_timer > 3000) {
					armed = false;
					EKF.armed = false;
					HAL_GPIO_WritePin(GPIOA, GPIO_PIN_15, GPIO_PIN_RESET);

				}

		}

		else {
			disarm_start = false;
		}
	}
}

void TelemPack() {
	  telem_pack.attitude.roll  = state.angles[0];
	  telem_pack.attitude.pitch = state.angles[1];
	  telem_pack.attitude.yaw   = state.angles[2];

	  telem_pack.pwm.w1 = controller_output[0];
	  telem_pack.pwm.w2 = controller_output[1];
	  telem_pack.pwm.w3 = controller_output[2];
	  telem_pack.pwm.w4 = controller_output[3];

	  telem_pack.attitude_des.roll  = controller.roll_des;
	  telem_pack.attitude_des.pitch = controller.pitch_des;
	  telem_pack.attitude_des.yaw   = yaw_counter;

	  telem_pack.attitude_rate.roll  = state.rates[0];
	  telem_pack.attitude_rate.pitch = state.rates[1];
	  telem_pack.attitude_rate.yaw 	 = state.rates[2];

	  telem_pack.attitude_rate_des.roll =  state_des.rates[0];
	  telem_pack.attitude_rate_des.pitch = state_des.rates[1];

	  telem_pack.ekf.roll_acc  = EKF.roll_acc;
	  telem_pack.ekf.pitch_acc = EKF.pitch_acc;

	  telem_pack.ekf.roll_gyro  = EKF.gyro[0];
	  telem_pack.ekf.pitch_gyro = EKF.gyro[1];

	  telem_pack.ekf.roll_comp =  EKF.roll_bias;
	  telem_pack.ekf.pitch_comp = EKF.pitch_bias;

	  telem_pack.ekf.roll_ekf =  EKF.roll_ekf;
	  telem_pack.ekf.pitch_ekf = EKF.pitch_ekf;

	  telem_pack.pid_roll.P = controller.pid_roll.P;
	  telem_pack.pid_roll.I = controller.pid_roll.I;
	  telem_pack.pid_roll.D = controller.pid_roll.D;
	  telem_pack.pid_roll.pd_roll_sat_buf = controller.pid_roll.pd_roll_sat_buf;

	  telem_pack.pid_pitch.P = controller.pid_pitch.P;
	  telem_pack.pid_pitch.I = controller.pid_pitch.I;
	  telem_pack.pid_pitch.D = controller.pid_pitch.D;
	  telem_pack.pid_pitch.pd_roll_sat_buf = controller.pid_pitch.pd_roll_sat_buf;

	  telem_pack.sonar_alt = EKF.sonar_alt;
	  telem_pack.velocity_body.z = EKF.vz;
	  telem_pack.position_body.z = EKF.alt_gnd;

	  telem_pack.cam_data.detected = cam_data_20.detected;
	  telem_pack.cam_data.x = cam_data_20.x;
	  telem_pack.cam_data.y = cam_data_20.y;
	  telem_pack.cam_data.z_cam = cam_data_20.z_cam;


	  telem_pack.position_body.x = EKF.x;
	  telem_pack.velocity_body.x = EKF.vx;
	  telem_pack.position_body.y = EKF.y;
	  telem_pack.velocity_body.y = EKF.vy;

	  telem_pack.alt_thr = controller.alt_thr;

