moralkerim/STM32Quadrotor/Drone_Controller_3DOF/Core/Src/main.cpp
	  telem_pack.time_millis = HAL_GetTick();

	  telem_pack.acc.x = accXc;
	  telem_pack.acc.y = accYc;
	  telem_pack.acc.z = accZm;

	  telem_pack.mag.x = MAG_X_CALIB;
	  telem_pack.mag.y = MAG_Y_CALIB;
	  telem_pack.mag.z = MAG_Z_CALIB;

	  /*
	  telem_pack.gps.lla.x = gpsData.ggastruct.lcation.latitude;
	  telem_pack.gps.lla.y = gpsData.ggastruct.lcation.longitude;

	  telem_pack.gps.pos_body.x = EKF.xbody;
	  telem_pack.gps.pos_body.y = EKF.ybody;

	  telem_pack.gps.pos_ned.x = EKF.xned;
	  telem_pack.gps.pos_ned.y = EKF.yned;

	  telem_pack.gps.vel_body.x = EKF.vgpsx;
	  telem_pack.gps.vel_body.y = EKF.vgpsy;
	   */

	  telem_pack.ch.ch1 = (uint16_t)ch[0];
	  telem_pack.ch.ch2 = (uint16_t)ch[1];
	  telem_pack.ch.ch3 = (uint16_t)ch[2];
	  telem_pack.ch.ch4 = (uint16_t)ch[3];
	  telem_pack.ch.ch5 = (uint16_t)ch[4];
	  telem_pack.ch.ch6 = (uint16_t)ch[5];
	  telem_pack.ch.ch7 = (uint16_t)ch[6];
	  telem_pack.ch.ch8 = (uint16_t)ch[7];
	  telem_pack.ch.ch9 = (uint16_t)ch[8];
	  telem_pack.ch.ch10 = (uint16_t)ch[9];
	  telem_pack.ch.ch11 = (uint16_t)ch[10];

	  telem_pack.pwm2.w1 = controller_output_2[0];
	  telem_pack.pwm2.w2 = controller_output_2[1];
	  telem_pack.pwm2.w3 = controller_output_2[2];
	  telem_pack.pwm2.w4 = controller_output_2[3];

	  memcpy(buf,&telem_pack,sizeof(telem_pack));
}

void SendTelem() {
	  TelemPack();
	  char end_char = 0x01;
	  HAL_UART_Transmit_DMA(&huart2, (uint8_t*)&end_char, sizeof(end_char));
	  HAL_UART_Transmit_DMA(&huart2, (uint8_t*)buf, sizeof(struct telem_pack));
	  end_char = 0x04;
	  HAL_UART_Transmit_DMA(&huart2, (uint8_t*)&end_char, sizeof(end_char));

	  sent_time = HAL_GetTick();


}

int16_t GyroOku (uint8_t addr) {
	uint8_t gyro_data[2];
	HAL_I2C_Mem_Read(&hi2c1, (uint16_t)MPU6050 | I2C_READ, addr, 1, gyro_data, 2, 1);
	int16_t gyro = gyro_data[0]<<8 | gyro_data[1];
	return gyro;
}

void GPSInit() {
	uint8_t Disable_GPGSV[11] = {0xB5, 0x62, 0x06, 0x01, 0x03, 0x00, 0xF0, 0x03, 0x00, 0xFD, 0x15};
	HAL_UART_Transmit(&huart3, (uint8_t*)Disable_GPGSV, 11, 100);
	uint8_t Set_to_5Hz[14] = {0xB5, 0x62, 0x06, 0x08, 0x06, 0x00, 0xC8, 0x00, 0x01, 0x00, 0x01, 0x00, 0xDE, 0x6A};
	HAL_UART_Transmit(&huart3, (uint8_t*)Set_to_5Hz, 14, 100);
	uint8_t Set_to_115[28] = {0xB5, 0x62, 0x06, 0x00, 0x14, 0x00, 0x01, 0x00, 0x00, 0x00, 0xD0, 0x08, 0x00, 0x00, 0x00, 0xC2, 0x01, 0x00, 0x07, 0x00, 0x03, 0x00, 0x00, 0x00, 0x00, 0x00, 0xC0, 0x7E};
	HAL_UART_Transmit(&huart3, (uint8_t*)Set_to_115, 28, 100);


    HAL_UART_Abort_IT(&huart3);

    HAL_UART_DeInit(&huart3);

    huart3.Init.BaudRate = 115200;

    if (HAL_UART_Init(&huart3) != HAL_OK) {
        Error_Handler();
    }


}

float pwm2ang(unsigned short int pwm) {
	int dead_zone = 5;

	int in_min  = 1000;
	int in_max  = 2000;

	/*
	int in_min  = 1160;
	int in_max  = 1850;
	*/
	int out_min = -20;
	int out_max  = 20;
	unsigned short int pwm_out;

	if(pwm > 1500 - dead_zone && pwm < 1500 + dead_zone) {
		pwm_out = 1500;
	}

	else {
		pwm_out = pwm;
	}

	return (pwm_out - in_min) * (out_max - out_min) / (in_max - in_min) + out_min;
}

float pwm2rate(unsigned short int pwm) {

	int in_min  = 1000;
	int in_max  = 2000;

	/*
	int in_min  = 1160;
	int in_max  = 1850;
	 */
	int out_min = -100;
	int out_max  = 100;

	return -1 * ((pwm - in_min) * (out_max - out_min) / (in_max - in_min) + out_min);
}


int16_t AccOku (uint8_t addr) {
	uint8_t gyro_data[2];
	HAL_I2C_Mem_Read(&hi2c1, (uint16_t)ADXL345 | I2C_READ, addr, 1, gyro_data, 2, 1);
	int16_t gyro = (gyro_data[1]<<8) | gyro_data[0];
	return gyro;
}

struct attitude DCM2Euler(int16_t acc[3], int16_t mag[3]) {
	struct attitude euler_angles;
	float rad2deg = 180.0/3.14;
	float acctop = sqrt(acc[0]*acc[0] + acc[1]*acc[1] + acc[2]*acc[2]);

	//float A = (acctop*sqrt(square(acc[0]*mag[1] - acc[1]*mag[0]) + square(acc[0]*mag[2] - acc[2]*mag[0]) + square(acc[1]*mag[2] - acc[2]*mag[1])));
	//float DCM11 = (mag[0]*acc[1]*acc[1] - acc[0]*mag[1]*acc[1] + mag[0]*acc[2]*acc[2] - acc[0]*mag[2]*acc[2])/A;
	float DCM11 = (mag[0]*acc[1]*acc[1] - acc[0]*mag[1]*acc[1] + mag[0]*acc[2]*acc[2] - acc[0]*mag[2]*acc[2])/(acctop*sqrt(square(acc[0]*mag[1] - acc[1]*mag[0]) + square(acc[0]*mag[2] - acc[2]*mag[0]) + square(acc[1]*mag[2] - acc[2]*mag[1])));
	//A = sqrt(square(acc[0]*mag[1] - acc[1]*mag[0]) + square(acc[0]*mag[2] - acc[2]*mag[0]) + square(acc[1]*mag[2] - acc[2]*mag[1]));
	//float DCM21 = -(acc[1]*mag[2] - acc[2]*mag[1])/A;
	float DCM21 = -(acc[1]*mag[2] - acc[2]*mag[1])/sqrt(square(acc[0]*mag[1] - acc[1]*mag[0]) + square(acc[0]*mag[2] - acc[2]*mag[0]) + square(acc[1]*mag[2] - acc[2]*mag[1]));


	float DCM31 = -acc[0]/acctop;
	float DCM32 = -acc[1]/acctop;
	float DCM33 = -acc[2]/acctop;
	//euler_angles.pitch = rad2deg*atan2(-DCM31,x);
	float pitch = asin(-DCM31);
	float cp = cos(pitch);

	euler_angles.pitch = rad2deg*pitch;
	//pitch = asin(pitch);
	euler_angles.roll = rad2deg*atan(DCM32/DCM33);
	float yaw = rad2deg*atan2(DCM21/cp,DCM11/cp);
	//-euler_angles.yaw  = rad2deg*atan2(DCM21,DCM11);
	if((int)yaw < -175 && (int)yaw >= -180) {
			//yaw_sign = POSITIVE;
		if(yaw_sign != POSITIVE && -1*EKF.gyro[2] > 0) {
			yaw_counter++;
			yaw_sign = POSITIVE;
		}

	}
	else if((int)yaw > 175 && (int)yaw <= 180) {
			//yaw_sign = NEGATIVE;
		if(yaw_sign != POSITIVE && -1*EKF.gyro[2] < 0) {
			yaw_counter--;
			yaw_sign = POSITIVE;
		}
	}

	else if(jump_counter > 50) { //Approx 1 sec.
		yaw_sign = NEUTRAL;
		jump_counter = 0;
	}

	if(yaw_sign != NEUTRAL) {
		jump_counter++;
	}

	yaw += yaw_counter*360;
	euler_angles.yaw = yaw;

	/*
	switch(yaw_sign) {
		case POSITIVE:
			euler_angles.yaw += 360;
			break;
		case NEGATIVE:
			euler_angles.yaw -=360;
			break;
	}
*/
	//euler_angles.yaw = (atan2((float) mag[1], (float) mag[0]) * 180 / M_PI);
	//yaw = acos(yaw);
	//euler_angles.pitch  = rad2deg*pitch;
	//euler_angles.roll   = rad2deg*roll;
	//euler_angles.yaw    = rad2deg*yaw;
	return euler_angles;

}

float square(float x) {
	float y = x*x;
	return y;
}

void PWMYaz() {

	/*
  if(!motor_start) {
			  MotorBaslat();
			  motor_start = true;
		  }

*/

#ifdef UAV1


		  if(armed) {

